src/Documents/УпаковатьЗаказы/УпаковатьЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УпаковатьЗаказы</name>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.УпакованныеЗаказы</registerRecords>
  <attributes>
    <name>ТочкаОтправитель</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСупергруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияСупергруппы</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГабаритСупергруппы</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.ОтправлениеТранзита</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Транзит/Транзит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Транзит</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПокупкаСсылка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/Коробки/Коробки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Коробки</name>
  <predefined>
    <items>
      <name>БезКоробки</name>
      <description>Без коробки</description>
    </items>
  </predefined>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>КРазбору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаВТК</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтикера</name>
    <type>
      <types>EnumRef.ВидыСтикеров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусГруппыДоставки</name>
    <type>
      <types>EnumRef.СтатусыГруппыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплаты</name>
    <type>
      <types>EnumRef.МетодыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиПредоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВзвешивания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастникГД</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Взвешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлениеТранзита</name>
    <type>
      <types>DocumentRef.ОтправлениеТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервогоПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаСкладе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимоИсключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимоУдалить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусГруза</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаСбора</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдачаТранзита</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОДоставке</name>
    <type>
      <types>DocumentRef.ОтчетОДоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШК</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Исключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеУдаления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Поступило</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/УпаковатьЗаказы/ObjectModule.bsl
#Область Проведение

Процедура ОбработкаПроведения(Отказ, Режим)
	Документы.УпаковатьЗаказы.ПроверитьНаличие(ЭтотОбъект,Отказ);
	
	#Область ПравильноеПроведение
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, Режим);
	Документы.УпаковатьЗаказы.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СП_ДвиженияСервер.ОтразитьТранзит(ДополнительныеСвойства, Движения, Отказ);
	СП_ДвиженияСервер.ОтразитьУпакованныеЗаказы(ДополнительныеСвойства, Движения, Отказ);
	#КонецОбласти
	
КонецПроцедуры


#КонецОбласти



Процедура ЗаполнитьПоТочкеНазначения(ОчищатьЗаказы=Ложь)   Экспорт
	Если не ЗначениеЗаполнено(ТочкаНазначения) Тогда
		Возврат;
	КонецЕсли;	
	Дата=ТекущаяДата();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Подбор КАК Подбор,
		|	ТранзитОстатки.ПокупкаСсылка КАК Покупка,
		|	ТранзитОстатки.Участник КАК Участник,
		|	ТранзитОстатки.МестоХранения КАК МестоХранения,
		|	ТранзитОстатки.Габарит КАК Габарит,
		|	СУММА(ТранзитОстатки.КоличествоОстаток) КАК КоличествоМест,
		|	СУММА(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ТранзитОстатки.ПокупкаСсылка) = ТИП(Справочник.Коробки)
		|				ТОГДА ТранзитОстатки.ПокупкаСсылка.Количество
		|			ИНАЧЕ ТранзитОстатки.КоличествоОстаток
		|		КОНЕЦ) КАК Количество,
		|	ТранзитОстатки.Партия КАК Партия
		|ИЗ
		|	РегистрНакопления.Транзит.Остатки(&ДатаДокумента, Точка = &Точка) КАК ТранзитОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТранзитОстатки.Габарит,
		|	ТранзитОстатки.МестоХранения,
		|	ТранзитОстатки.ПокупкаСсылка,
		|	ТранзитОстатки.Участник,
		|	ТранзитОстатки.Партия
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТранзитОстатки.КоличествоОстаток) > 0";

	Запрос.УстановитьПараметр("Точка", ТочкаНазначения);
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Подбор", Константы.ПомечатьЗаказыПриФормированииДокументаВыдачаТранзита.Получить());

	Результат 	= Запрос.Выполнить();
	выборка 	= Результат.Выбрать();
	Если ОчищатьЗаказы Тогда
		Покупки.Очистить();
	КонецЕсли;	
		
	Пока выборка.Следующий() Цикл
		стр_покупок = Покупки.Добавить();
		ЗаполнитьЗначенияСвойств(стр_покупок, выборка);
		структура_Стоимости 			= СП_РаботаСДокументами.ПолучитьСтоимостьХранения(Выборка,Дата);
		Стр_Покупок.ВремяХранения     	= структура_Стоимости.ВремяХранения;
		Стр_Покупок.СтоимостьХранения 	= структура_Стоимости.СтоимостьХранения;
		
		
		стр_покупок.Подбор 				= Ложь;
	КонецЦИкла;	
	СтоимостьИтого	=	Покупки.Итог("СтоимостьХранения");	

КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		НеПомеченныеСтроки=Покупки.НайтиСтроки(Новый Структура("Подбор",ложь));
		Для каждого стр из НеПомеченныеСтроки Цикл
			Покупки.Удалить(стр);
		КонецЦикла
	Конецесли;

КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
